var dealer = {
	"北京": {
		"北京": ["北京鹏元",
			"北京全福源",
			"北京联发志成",
			"北京鹏远兴业",
			"北京恒盛恒远",
			"北京天乐国汽",
			"北京泓建祥源",
			"北京京柔东方",
			"北京永超",
			"北京天通瑞",
			"北京奥祥瑞",
			"北京佰特惠",
			"北京中农通盛",
			"北京凯翔风",
			"北京北方伟业"
		],
	},
	"上海": {
		"上海": ["上海瑞众",
			"上海吉璞"
		]
	},
	"安徽": {
		"安庆": ["安庆光耀"],
		"六安": ["六安京丰"],
		"宿州": ["宿州润宣"],
		"阜阳": ["阜阳金源"],
		"蚌埠": ["蚌埠京宝"],
		"合肥": ["合肥京灏",
			"合肥京瑞"
		],
		"滁州": ["滁州凯麒"],
		"淮南": ["淮南京德"],
		"马鞍山": ["马鞍山瑞隆"],
		"芜湖": ["芜湖宝盈"],
		"亳州": ["亳州众茂"],
		"宣城": ["宣城瑞和"],
	},
	"福建": {
		"泉州": ["泉州金盈"],
		"厦门": ["厦门富饶明威"],
		"福清": ["福清三丰"],
		"福州": ["福州鑫三丰"],
		"漳州": ["漳州国鸿"],
	},
	"甘肃": {
		"兰州": ["兰州鹏龙永欣"],
		"天水": ["天水九州通达"],
		"白银": ["白银恒信北方"],
		"庆阳": ["庆阳峰通"],
	},
	"广东": {
		"深圳": ["深圳昊天林"],
		"东莞": ["东莞富新"],
		"广州": ["广州安迪嘉",
			"广州德能"
		],
		"惠州": ["惠州四海"],
		"中山": ["中山三联"],
		"佛山": ["佛山东富"],
		"河源": ["河源四海"],
		"江门": ["江门东绅"],
		"清远": ["清远华益"],
		"湛江": ["湛江环贸"],
		"珠海": ["珠海银河森宝"],
	},
	"广西": {
		"桂林": ["桂林大川"],
		"南宁": ["南宁新源",
			"南宁经菱绅源"
		],
	},
	"贵州": {
		"贵阳": ["贵阳瀚羿睿博"],
		"贵州": ["遵义千誉"],
		"铜仁": ["铜仁南方"],
		"兴义": ["兴义开云"],
		"安顺": ["安顺开元"],
		"六盘水": ["六盘水绅通"],
	},
	"海南": {
		"海口": ["海口永诚"]
	},
	"河北": {
		"沧州": ["沧州京驰",
			"任丘京驰"
		],
		"邢台": ["邢台德润盛鹏"],
		"石家庄": ["石家庄北拓",
			"石家庄共达"
		],
		"邯郸": ["邯郸北华",
			"邯郸鹏宝"
		],
		"廊坊": ["廊坊汇之杰"],
		"张家口": ["张家口京汽福安"],
		"保定": ["保定庞大骏马",
			"保定北斗鑫"
		],
		"定州": ["定州神建"],
		"衡水": ["衡水庞大龙华",
			"衡水京驰"
		],
		"保定易县": ["保定北健众诚"],
		"南宫": ["南宫京南"],
		"秦皇岛": ["秦皇岛瑞通"],
		"霸州": ["霸州亿龙嘉业"],
	},
	"河南": {
		"郑州": ["郑州大广"],
		"洛阳": ["洛阳宝顺",
			"洛阳誉达"
		],
		"安阳": ["安阳融创",
			"安阳志和"
		],
		"平顶山": ["平顶山万鹏"],
		"濮阳": ["濮阳中易"],
		"新乡": ["新乡新东安"],
		"三门峡": ["三门峡金鼎"],
		"鹤壁": ["鹤壁宝骏"],
		"济源": ["济源庆利"],
		"焦作": ["焦作京凯"],
		"信阳": ["信阳盛之润"],
		"周口": ["周口周泰"],
		"许昌": ["许昌大广"],
		"驻马店": ["驻马店德奥"],
		"漯河": ["漯河京鸿"],
		"开封": ["开封广达"],
		"商丘": ["商丘大广"],
		"南阳": ["南阳润通",
			"南阳润通",
			"南阳京润"
		],
	},
	"黑龙江": {
		"大庆": ["大庆澳顺"],
		"佳木斯": ["佳木斯宝瑞行"],
		"哈尔滨": ["哈尔滨金亿达"],
		"齐齐哈尔": ["齐齐哈尔光瑞"],
		"牡丹江": ["牡丹江鸿盛源"],
	},
	"湖北": {
		"宜昌": ["宜昌华宇"],
		"襄阳": ["襄阳富黄京通"],
		"十堰": ["十堰腾泽欧龙"],
		"武汉": ["武汉富森骏宝",
			"武汉东瑞"
		],
		"黄石": ["黄石京瑞"],
		"荆州": ["荆州宏远"],
		"麻城": ["黄冈大绅"],
	},
	"湖南": {
		"长沙": ["长沙中拓瑞博",
			"长沙脸谱"
		],
		"衡阳": ["衡阳恒晖"],
		"怀化": ["怀化三和"],
		"郴州": ["郴州京湖"],
		"娄底": ["娄底鑫邦"],
		"岳阳": ["岳阳驰骏"],
		"益阳": ["益阳欣海"],
		"邵阳": ["邵阳骏越"],
	},
	"吉林": {
		"长春": ["长春万城",
			"长春润城"
		],
		"白城": ["白城天意"],
		"延吉": ["延吉隆骏"],
		"松原": ["松原鑫华晟"],
	},
	"江苏": {
		"南京": ["南京协众凯捷",
			"南京高淳万帮"
		],
		"连云港": ["连云港润有"],
		"宿迁": ["宿迁卫东"],
		"淮安": ["淮安银盾"],
		"泰州": ["泰州宝泽"],
		"盐城": ["盐城永润"],
		"常州": ["常州君绅"],
		"如皋": ["如皋茂源"],
		"苏州": ["苏州瀚翔"],
		"无锡": ["无锡恒大"],
		"常熟": ["常熟利康"],
		"镇江": ["丹阳宝誉",
			"镇江京之宝"
		],
		"徐州": ["徐州百骏",
			"徐州金现"
		],
		"扬州": ["扬州中太"],
		"昆山": ["昆山永晟泰"],
	},
	"江西": {
		"南昌": ["南昌华骏行",
			"南昌启源"
		],
		"九江": ["九江京通"],
		"上饶": ["上饶鑫宝荣"],
		"景德镇": ["景德镇京通"],
		"赣州": ["赣州广缘"],
		"吉安县": ["吉安通永"],
		"宜春": ["宜春永邦"],
	},
	"辽宁": {
		"沈阳": ["沈阳汇歌",
			"沈阳诗迪"
		],
		"大连": ["大连华诺",
			"大连德科"
		],
		"营口": ["营口维沃"],
		"盘锦": ["盘锦新嘉利"],
		"锦州": ["锦州众鑫"],
		"阜新": ["阜新华天"],
		"铁岭": ["铁岭鹏飞"],
		"鞍山": ["鞍山世纪星"]
	},
	"内蒙古": {
		"呼和浩特": ["呼和浩特众洲",
			"呼和浩特庞大华福乐业"
		],
		"巴彦淖尔": ["巴彦淖尔隆睿"],
		"呼伦贝尔": ["呼伦贝尔友通"],
		"兴安盟": ["乌兰浩特鑫尊"],
		"通辽": ["通辽惠都"],
		"包头": ["包头欢腾"],
		"鄂尔多斯": ["鄂尔多斯万岳"],
	},
	"宁夏": {
		"银川": ["银川怡广"],
	},
	"青海": {
		"西宁": ["西宁金盛强"],
	},
	"山东": {
		"滨州": ["滨州华洋",
			"滨州润悦",
			"滨州润悦"
		],
		"德州": ["德州和远"],
		"东营": ["东营银龙"],
		"菏泽": ["菏泽正泰"],
		"济南": ["济南宝盈",
			"济南得盛"
		],
		"济宁": ["济宁京驰",
			"滨州润悦",
			"济宁北润"
		],
		"聊城": ["聊城华伟"],
		"临沂": ["临沂九州顺嘉",
			"临沂顺威"
		],
		"青岛": ["青岛石大",
			"青岛中来",
			"青岛京泰"
		],
		"日照": ["日照乾方"],
		"泰安": ["泰安和泰"],
		"威海": ["威海恒大"],
		"潍坊": ["潍坊兆和"],
		"烟台": ["烟台润亨",
			"烟台鸿程"
		],
		"枣庄": ["枣庄恒基",
			"枣庄恒基"
		],
		"诸城": ["诸城金世都"],
		"淄博": ["淄博海杰",
			"淄博京驰"
		],

	},
	"山西": {
		"太原": ["太原和義轩",
			"太原聚福源",
			"太原泓建祥源"
		],
		"运城": ["运城威龙"],
		"大同": ["大同博和"],
		"阳泉": ["阳泉鼎晟"],
		"临汾": ["临汾京源驰恒"],
		"晋城": ["晋城机电"],
		"长治": ["长治鼎瑞"],
		"忻州": ["忻州华昌"],
		"朔州": ["朔州宗源"],
	},
	"陕西": {
		"西安": ["西安华瑞"],
		"汉中": ["汉中汉邦"],
		"渭南": ["渭南荣大"],
		"宝鸡": ["宝鸡众汇"],
		"咸阳": ["咸阳卓越"],
		"延安": ["延安中庆源"],
		"榆林": ["榆林安路达"],
	},
	"四川": {
		"巴中": ["巴中丽驰"],
		"成都": ["成都盛国",
			"成都万嘉锦蓉",
			"成都绅达兴"
		],
		"达州": ["达州德绅"],
		"德阳": ["德阳德绅"],
		"广安": ["广安金峻峰"],
		"广元": ["广元广发"],
		"乐山": ["乐山国瑞"],
		"泸州": ["泸州盛国"],
		"眉山": ["四川三禾快洁"],
		"绵阳": ["绵阳盛国"],
		"南充": ["南充金德源"],
		"遂宁": ["遂宁益安钺达"],
		"宜宾": ["宜宾港汇"],
	},
	"天津": {
		"天津": ["天津美鸿",
			"天津天骏广大",
			"天津新兴锐宝"
		],
	},
	"新疆": {
		"乌鲁木齐": ["乌鲁木齐天汇华恒"],
		"阿克苏": ["阿克苏璞宁"],
		"石河子": ["石河子隆庆"],
		"库尔勒": ["库尔勒万拓"],
		"乌鲁木齐": ["乌鲁木齐永泰"]
	},
	"云南": {
		"保山": ["腾冲天马"],
		"楚雄州": ["楚雄通驰"],
		"大理": ["大理七泰"],
		"红河": ["红河七泰"],
		"昆明": ["昆明孝尊",
			"昆明孝尊悦途",
			"昆明飞骐"
		],
		"普洱": ["普洱邦龙"],
		"曲靖": ["曲靖孝尊"],
		"西双版纳": ["西双版纳孝尊"],
		"玉溪": ["玉溪和众"]
	},
	"浙江": {
		"杭州": ["杭州宝盈"],
		"湖州": ["湖州得凌"],
		"嘉兴": ["嘉兴京吉"],
		"金华": ["金华金翔"],
		"宁波": ["宁波嘉德"],
		"衢州": ["衢州京都"],
		"绍兴": ["绍兴汇业"],
		"台州": ["台州泽辉",
			"台州铭特",
			"杭州和平"
		],
		"温州": ["温州腾邦"],
		"义乌": ["义乌绅远"]
	},
	"重庆": {
		"重庆": ["重庆正博",
			"重庆铭骁",
			"重庆长灏",
			"重庆绅豪",
			"重庆万象"
		]
	},

}
var province=$("#province");
var city = $("#city");
var dealerName=$("#dealerName");
linkage(province,city,dealerName,dealer);
province.on({
	change:function(){		
		if(province.val()==""){				
			city.html("");			
			city.append('<option value="">地级市</option>');	
		}
	}
})

